{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "dbb78d56",
   "metadata": {},
   "source": [
    "This notebook populates a neo4j Graph Database with Pokemon information fetched from the pokeapi API (up to date until Gen 9), and allows for questions regarding the database to gpt-4o."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fef386b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import json\n",
    "from neo4j import GraphDatabase\n",
    "from pathlib import Path\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "import pandas as pd\n",
    "from tqdm import tqdm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "566cacd8",
   "metadata": {},
   "outputs": [],
   "source": [
    "dotenv_path = Path('~/.env').expanduser()\n",
    "load_dotenv(dotenv_path=dotenv_path)  # This line brings all environment variables from .env into os.environ\n",
    "\n",
    "# Get variables\n",
    "POKEDEX_URI = os.getenv('POKEDEX_URI')\n",
    "POKEDEX_USER = os.getenv('POKEDEX_USER')\n",
    "POKEDEX_PASSWORD = os.getenv('POKEDEX_PASSWORD')\n",
    "#database_name = os.getenv('DATABASE_NAME')\n",
    "\n",
    "driver = GraphDatabase.driver(POKEDEX_URI, auth=(POKEDEX_USER, POKEDEX_PASSWORD))\n",
    "# if((driver.verify_connectivity())=='None'):\n",
    "#     print(\"Driver connectivity okay\")\n",
    "driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68500585",
   "metadata": {},
   "source": [
    "------------------------------------------"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "36c56481",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         name          types              abilities\n",
      "0   Bulbasaur  grass, poison  overgrow, chlorophyll\n",
      "1     Ivysaur  grass, poison  overgrow, chlorophyll\n",
      "2    Venusaur  grass, poison  overgrow, chlorophyll\n",
      "3  Charmander           fire     blaze, solar-power\n",
      "4  Charmeleon           fire     blaze, solar-power\n"
     ]
    }
   ],
   "source": [
    "# fetch pokemon data from a given URL\n",
    "def fetch_pokemon_data(url):\n",
    "    response = requests.get(url)\n",
    "    return response.json()\n",
    "\n",
    "base_url = \"https://pokeapi.co/api/v2/pokemon\" #base url\n",
    "\n",
    "data = fetch_pokemon_data(base_url)\n",
    "\n",
    "pokemon_list = []\n",
    "\n",
    "# iterate through the pages and get data for each pokemon\n",
    "while data:\n",
    "    for pokemon in data['results']:\n",
    "        pokemon_data = fetch_pokemon_data(pokemon['url'])\n",
    "\n",
    "        # extract relevant information\n",
    "        name = pokemon_data[\"name\"]\n",
    "        types = [t[\"type\"][\"name\"] for t in pokemon_data[\"types\"]]\n",
    "        abilities = [a[\"ability\"][\"name\"] for a in pokemon_data[\"abilities\"]]\n",
    "\n",
    "        # append to list\n",
    "        pokemon_list.append({\"name\": name, \"types\": \", \".join(types), \"abilities\": \", \".join(abilities)})\n",
    "\n",
    "    # get the next page (if any)\n",
    "    next_url = data['next']\n",
    "    if next_url:\n",
    "        data = fetch_pokemon_data(next_url)\n",
    "    else:\n",
    "        break\n",
    "\n",
    "# create collective df\n",
    "df = pd.DataFrame(pokemon_list)\n",
    "df['name'] = df['name'].str.capitalize()\n",
    "\n",
    "print(df.head()) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "36df973b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1302/1302 [10:04<00:00,  2.15it/s]\n"
     ]
    }
   ],
   "source": [
    "# # Add an empty column to your DataFrame\n",
    "# df['evolves_from'] = None\n",
    "\n",
    "# # Loop through Pokémon and fetch evolution info\n",
    "# for idx, row in tqdm(df.iterrows(), total=len(df)):\n",
    "#     name = row['name'].lower()\n",
    "#     url = f\"https://pokeapi.co/api/v2/pokemon-species/{name}\"\n",
    "#     response = requests.get(url)\n",
    "\n",
    "#     if response.status_code == 200:\n",
    "#         species_data = response.json()\n",
    "#         evolves_from = species_data.get('evolves_from_species')\n",
    "#         if evolves_from:\n",
    "#             df.at[idx, 'evolves_from'] = evolves_from['name'].capitalize()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a267ebd2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         name            types                abilities\n",
      "0   Bulbasaur  [Grass, Poison]  [Overgrow, Chlorophyll]\n",
      "1     Ivysaur  [Grass, Poison]  [Overgrow, Chlorophyll]\n",
      "2    Venusaur  [Grass, Poison]  [Overgrow, Chlorophyll]\n",
      "3  Charmander           [Fire]     [Blaze, Solar-power]\n",
      "4  Charmeleon           [Fire]     [Blaze, Solar-power]\n"
     ]
    }
   ],
   "source": [
    "df['types'] = df['types'].apply(lambda x: [t.strip().capitalize() for t in x.split(',')] if isinstance(x, str) else x)\n",
    "df['abilities'] = df['abilities'].apply(lambda x: [t.strip().capitalize() for t in x.split(',')] if isinstance(x, str) else x)\n",
    "\n",
    "def split_commas(list):\n",
    "    result = []\n",
    "    for t in list:\n",
    "        if isinstance(t, str) and ',' in t:\n",
    "            result.extend([s.strip().capitalize() for s in t.split(',')])\n",
    "        else:\n",
    "            result.append(t.strip().capitalize() if isinstance(t, str) else t)\n",
    "    return result\n",
    "\n",
    "df['types'] = df['types'].apply(split_commas)\n",
    "df['abilities'] = df['abilities'].apply(split_commas)\n",
    "\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4742d667",
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_pokemon(tx,statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)\n",
    "\n",
    "def write_types(tx, statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)\n",
    "\n",
    "def write_abilities(tx, statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a6adb9de",
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_create_pokemon = \"\"\"MERGE (p:Pokemon {name:$name})\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        session.execute_write(write_pokemon, \n",
    "                                params_dict = {\n",
    "                                    'name':str(row['name'])\n",
    "                                },\n",
    "                                statement = statement_create_pokemon)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "627fa36d",
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_create_types = \"\"\"MERGE (t:Type {name:$type})\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        for type_name in row['types']:  # type_name will be 'water', 'grass', etc.\n",
    "            session.execute_write(\n",
    "                write_types, \n",
    "                params_dict={\n",
    "                    'type': str(type_name).capitalize()  # capitalize type names\n",
    "                },\n",
    "                statement=statement_create_types\n",
    "            )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e709bc7b",
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_create_abilities = \"\"\"MERGE (a:Ability {name:$ability})\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        for ability_name in row['abilities']:  \n",
    "            session.execute_write(\n",
    "                write_abilities, \n",
    "                params_dict={\n",
    "                    'ability': str(ability_name).capitalize() \n",
    "                },\n",
    "                statement=statement_create_abilities\n",
    "            )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7007583f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\Eleftheria\\AppData\\Local\\Temp\\ipykernel_19308\\3795341116.py:6: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n"
     ]
    }
   ],
   "source": [
    "statement_has_type = \"\"\"MATCH (p:Pokemon {name: $name})\n",
    "MATCH (t:Type {name:$type})\n",
    "MERGE (p)-[:HAS_TYPE]->(t)\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        pokemon_name = row['name']\n",
    "        for type_name in row['types']:\n",
    "            session.execute_write(\n",
    "                write_pokemon,\n",
    "                params_dict = {\n",
    "                    'name': pokemon_name,\n",
    "                    'type': type_name\n",
    "                },\n",
    "                statement = statement_has_type\n",
    "            )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7e01b151",
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_has_ability = \"\"\"MATCH (p:Pokemon {name: $name})\n",
    "MATCH (a:Ability {name:$ability})\n",
    "MERGE (p)-[:HAS_ABILITY]->(a)\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index, row in df.iterrows():\n",
    "        pokemon_name = row['name']\n",
    "        for ability_name in row['abilities']:\n",
    "            session.execute_write(\n",
    "                write_pokemon,\n",
    "                params_dict = {\n",
    "                    'name': pokemon_name,\n",
    "                    'ability': ability_name\n",
    "                },\n",
    "                statement = statement_has_ability\n",
    "            )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ab245216",
   "metadata": {},
   "source": [
    "---------------------------------------------------------- **LLM integration for question-answer rapport** ----------------------------------------------------------"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f840f986",
   "metadata": {},
   "outputs": [],
   "source": [
    "import openai"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4304e995",
   "metadata": {},
   "outputs": [],
   "source": [
    "openai.api_key = os.getenv('OPENAI_API_KEY')\n",
    "\n",
    "client = openai.OpenAI(api_key=os.getenv('OPENAI_API_KEY'))\n",
    "\n",
    "def ask_gpt4o(prompt):\n",
    "    response = client.chat.completions.create(\n",
    "        model=\"gpt-4o\",\n",
    "        messages=[{\"role\": \"user\", \"content\": prompt}],\n",
    "        temperature=0.3\n",
    "    )\n",
    "    return response.choices[0].message.content\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "01e5d64a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def question_to_cypher_and_answer(question):\n",
    "\n",
    "    # prompt LLM to translate the question into a Cypher query\n",
    "    prompt = f\"\"\"\n",
    "    You are a Cypher expert. Given the following question, respond ONLY with the Cypher query. \n",
    "    Do NOT include markdown or code block formatting. Just return the plain Cypher.\n",
    "\n",
    "    Question: \"{question}\"\n",
    "    \"\"\"\n",
    "    cypher_query = ask_gpt4o(prompt)\n",
    "    print(\"Generated Cypher Query:\\n\", cypher_query)\n",
    "\n",
    "    results = run_cypher(cypher_query)\n",
    "    print(\"Query Results:\\n\", results)\n",
    "\n",
    "    interpretation_prompt = f\"\"\"\n",
    "    Given the question: \"{question}\"\n",
    "    And the results: {results}\n",
    "    List the results. Do not interpret them and do not check whether their are factually correct.\n",
    "    \"\"\"\n",
    "    explanation = ask_gpt4o(interpretation_prompt)\n",
    "    return explanation\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "75d37443",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher Query:\n",
      " MATCH (p:Pokemon {name: 'Piplup'})-[:HAS_TYPE]->(t:Type)\n",
      "RETURN t.name\n",
      "Query Results:\n",
      " [{'t.name': 'Water'}]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\Eleftheria\\AppData\\Local\\Temp\\ipykernel_16484\\3894439219.py:2: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Water\n"
     ]
    }
   ],
   "source": [
    "question = \"What are the types of Piplup?\"\n",
    "print(question_to_cypher_and_answer(question))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "pokedex_venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
